<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 2, Part 1<br>Continuing Core Concepts, ER Modeling, Relational Algebra, SQL<br>
    
</span>
</center></i>

# Introduction and Overview

## HW Objectives

- HW 2, part 1 is for __both tracks.__


- We have covered additional concepts since HW 1. HW 2, part 1 tests and reinforces learning the new concepts.

## Submission Instructions

Complete all the tests in this notebook and submit only this notebook as a PDF to GradeScope. To convert the jupyter notebook into a pdf you can use either of the following methods:

- File --> Print Preview --> Print --> Save to PDF 

- File --> Download As HTML --> Print --> Save to PDF


__Due date: March 1, 11:59 PM EDT on GradeScope__



It is recommended that you put the screenshots into the same folder as this notebook so you do not have to alter the path to include your images. 


Please read all the instructions thoroughly!

## Guidelines

You may not work with or collaborate with anyone in any way to complete the homework. You may speak with the professor and TAs. You may ask __private__ questions on Ed if you need clarification.


You may use lecture slides, the textbook slides, the textbook or public information on the web to help you answer your questions. You may not "cut and past" information. Your answer must be in your own words and demonstrate the you understand the concept. If you use information for sources other than lectures, lecture slides, textbook slides or the textbook, you MUST provide a URL to the source you used.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [1]:
# Print your name, uni, and track below

name = "Ziggy Chen"
uni = "xc2605"
track = "Programming Track"

print(name)
print(uni)
print(track)

Ziggy Chen
xc2605
Programming Track

# Testing Environment

Run the following cells to ensure that your environment is set up.


You may need to change passwords.

## General Packages

In [2]:
import json

In [3]:
import csv

In [4]:
import pandas

In [5]:
import os

## pymysql

In [6]:
import pymysql

In [7]:
#
# Run this cell but change your user ID and password.
#
pymysql_conn = pymysql.connect(
    user="root",
    password="dbuserdbuser",
    host="localhost",
    port=3306,
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor
)

In [8]:
# You must have installed the db_book DB for this to work.
#
cursor = pymysql_conn.cursor()
sql = "select * from db_book.student"
res = cursor.execute(sql)
result = cursor.fetchall()

In [9]:
#
# You must have installed the db_book DB for this to work.
#
df1 = pandas.DataFrame(result)
df1

       ID      name   dept_name tot_cred
0   00128     Zhang  Comp. Sci.      102
1   12345   Shankar  Comp. Sci.       32
2   19991    Brandt     History       80
3   23121    Chavez     Finance      110
4   44553   Peltier     Physics       56
5   45678      Levy     Physics       46
6   54321  Williams  Comp. Sci.       54
7   55739   Sanchez       Music       38
8   70557      Snow     Physics        0
9   76543     Brown  Comp. Sci.       58
10  76653       Aoi  Elec. Eng.       60
11  98765  Bourikas  Elec. Eng.       98
12  98988    Tanaka     Biology      120

## ipython-SQL

In [10]:
%load_ext sql

In [11]:
#
# Remember to change your user ID and password.
#
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [12]:
%sql select * from db_book.student where ID=12345

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('12345', 'Shankar', 'Comp. Sci.', Decimal('32'))]

## SQLAlchemy

In [13]:
from sqlalchemy import create_engine

In [14]:
#
# Remember to change your user ID and password.
#
sql_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [15]:
engine = create_engine(sql_url)

In [16]:
sql = "select * from db_book.student"
df = pandas.read_sql(sql, con=engine)

In [17]:
df

       ID      name   dept_name  tot_cred
0   00128     Zhang  Comp. Sci.     102.0
1   12345   Shankar  Comp. Sci.      32.0
2   19991    Brandt     History      80.0
3   23121    Chavez     Finance     110.0
4   44553   Peltier     Physics      56.0
5   45678      Levy     Physics      46.0
6   54321  Williams  Comp. Sci.      54.0
7   55739   Sanchez       Music      38.0
8   70557      Snow     Physics       0.0
9   76543     Brown  Comp. Sci.      58.0
10  76653       Aoi  Elec. Eng.      60.0
11  98765  Bourikas  Elec. Eng.      98.0
12  98988    Tanaka     Biology     120.0

# Relational Algebra

## Instructions

- Use the [schema and data](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) associated with the recommended textbook. Clicking the link should take you directly to the RelaX page configured with the DB.


- Your submission format for each question is:
    - A Markdown cell with a copy of your relational algebra statement.
    - A screen shot of the execution. If the expression returns several result pages, you only need to show the first page.
    - There is an example below.

_Example_

Question:

Write a relational statement that produces a relation of the form:
- ```student_id``` is ```student.ID```
- ```student_name``` is ```student.name```
- ```advisor_id``` is ```instructor.ID```
- ```advisor_name``` is ```instructor.name```

The ```advisor``` table is an associative entity for ```student``` and ```instructor```.

Relational statement:

```π student_ID←student.ID, student_name←student.name,
	advisor_ID←instructor.ID, advisor_name←instructor.name
((
	student ⨝ 
		advisor.s_id=student.ID ∧ advisor.i_id = advisor.i_id
	advisor
)
⨝ instructor.ID=advisor.i_id
instructor
)
```

_Capture_

<img src="./relational_example_1.png">

## Question R1: Courses and Prereq

_Question_

- Please run the following relational algebra statement. The statement produces a table of course that do not have preqs and courses that are not prereq.

```
(π course_id←course.course_id, prereq_id←'None' (course ▷ prereq))
∪
(π
	course_id←'None', prereq_id←course.course_id 
	(course ▷ course.course_id=prereq.prereq_id prereq)
)
```


- Please write an equivalent query that does not use ```anti-join.```

_Answer_

```
π course_id ← course.course_id, prereq_id ← 'None' (
	σ prereq.course_id = null (course ⟕ course.course_id = prereq.course_id prereq)
) 
∪
π course_id ← 'None', prereq_id ← course.course_id (
    σ prereq.prereq_id = null (course ⟕ course.course_id = prereq.prereq_id prereq)
)
```

_Capture_

<img src="./R1Diagram.png">
<img src="./R1Table.png">

## Question R2:  Instructors and Credits

_Question_

Please write a relational algebra statement that produces a relation of the form:
- Columns
    - ```instructor_name``` is ```instructor.name```
    - ```instructor_id``` is ```instructor.ID```
    - ```teaching_credits_yearly``` is the total course credits that the instructor taught in a year. The information needed is in ```teaches``` and ```course```.
    - ```year``` is from ```teaches```.
- Sort the result by ```instructor_name``` and then ``year```.

_Answer_

```
τ instructor_name,  year 
(π instructor_name ← instructor.name, instructor_id ← instructor.ID, teaching_credits_yearly, year ← teaches.year
	(
		γ teaches.ID, year; sum(course.credits) → teaching_credits_yearly (teaches ⟕ course) 
		⨝ teaches.ID = instructor.ID instructor
	)
)
```

_Capture_

<img src="./R2Diagram.png">
<img src="./R2Table.png">

# ER Modeling and Implementation

## Data

- We will do bottom up modeling and implementation starting with data.


- There are two entity sets for reengineering:
    1. ```customers```
    2. ```reservations``` is a single set containing three types of reservation:
        1. ```Flight```
        2. ```Rental car```
        3. ```Hotel```


- The input data is:

In [18]:
customers_df = pandas.read_csv('./customers-3.csv')

In [19]:
customers_df

,customer_id,first_name,last_name,email
0,4fc2a5e7-859c-494f-9f82-9ef3da9c6265,Lew,Jagiela,ljagiela0@comsenz.com
1,e649dc5e-5570-43f6-837c-89379800179f,Karin,De Ruggiero,kderuggiero1@linkedin.com
2,a20afabf-86af-4070-9c7c-4b4643202013,Georgena,Gapp,ggapp2@ed.gov
3,12d17b18-f009-49fd-a887-eaab9cd60274,Enrika,Thripp,ethripp3@newsvine.com
4,d9a14dd2-0000-4227-bf30-6907efb4caa7,Edin,Seyler,eseyler4@geocities.jp
...,...,...,...,...
995,bbe5ca2a-b5e1-4ff6-a1d6-450bdf41f6ec,Sean,Wagen,swagenr8@abc.net.au
996,a6632fc7-316b-4ad5-9b2c-977f7a732d54,Delmar,Benoy,dbenoyr9@multiply.com
997,3f05996b-5c79-429f-aacb-2367255cc495,Crin,Smooth,csmoothra@blogger.com
998,8e88da67-2e28-4330-bfa2-17c4369c96cf,Riobard,Ricket,rricketrb@va.gov
999,493ca6a1-b2c7-4c1d-817f-3a0d73f8f24c,Neville,Blowen,nblowenrc@etsy.com

In [20]:
reservations_df = pandas.read_csv("./reservations-3.csv")

In [21]:
import numpy as np

In [22]:
reservations_df = reservations_df.replace({np.nan: None})

In [23]:
reservations_df

,reservation_id,customer_id,reservation_type,price,reservation_date,city,reservation_start,reservation_end,car_category,room_category,bed_category,flight_departure_time,flight_arrival_time,departure_airport,arrival_airport
0,b097458e-898a-40a0-85eb-cedb0ea47466,4fc2a5e7-859c-494f-9f82-9ef3da9c6265,Car,$126.30,2/23/2022,Granja,2/21/2022,8/18/2022,Midsize,None,None,None,None,None,None
1,67070e81-81f0-4d95-9302-98486a08bf73,e649dc5e-5570-43f6-837c-89379800179f,Hotel,$792.89,1/30/2023,Kavalerovo,8/23/2022,1/19/2023,None,Studio,King,None,None,None,None
2,f164e71e-4874-4c42-beb4-27c2c6f5af0f,a20afabf-86af-4070-9c7c-4b4643202013,Hotel,$660.09,9/30/2022,Daxi,8/20/2022,8/23/2022,None,Suite,Two Doubles,None,None,None,None
3,7b088670-9567-4068-8571-946dd085dab5,12d17b18-f009-49fd-a887-eaab9cd60274,Flight,$423.59,1/9/2023,None,None,None,None,None,None,12:59 AM,3:06 AM,MFR,SKV
4,ca849908-b88e-49d8-b52b-2aeb88b3c949,d9a14dd2-0000-4227-bf30-6907efb4caa7,Hotel,$552.07,11/5/2022,Albuquerque,8/24/2022,4/15/2022,None,Suite,King,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,16b955d3-0181-4ad3-9654-0fea52bf1094,bbe5ca2a-b5e1-4ff6-a1d6-450bdf41f6ec,Hotel,$169.73,2/3/2023,Cibunar,12/17/2022,4/16/2022,None,Studio,King,None,None,None,None
996,caa55cf1-3032-42b4-94d5-2f8ac70585ce,a6632fc7-316b-4ad5-9b2c-977f7a732d54,Hotel,$517.19,6/12/2022,Quiling,3/12/2022,3/17/2022,None,Studio,King,None,None,None,None
997,e99b7c4f-1e14-42e1-9598-5010172f3454,3f05996b-5c79-429f-aacb-2367255cc495,Car,$636.63,2/11/2023,Hukeng,8/6/2022,7/19/2022,SUV,None,None,None,None,None,None
998,c54b4398-3eb7-46a0-9906-d2acc04f0e90,8e88da67-2e28-4330-bfa2-17c4369c96cf,Car,$174.76,11/10/2022,Pravdinsk,10/16/2022,12/7/2022,Compact,None,None,None,None,None,None
999,4c942bd8-2d80-4d57-9281-0e6387ed7f51,493ca6a1-b2c7-4c1d-817f-3a0d73f8f24c,Car,$662.24,11/10/2022,Kongolo,10/15/2022,4/3/2022,Midsize,None,None,None,None,None,None

## Model

- You are going to model _interitance/specialization._
    - There is a base entity type _Reservation._
    - _CarReservation_ __isA__ _Reservation._
    - _FlightReservation_ __isA__ _Reservation._
    - _HotelReservation_ __isA__ _Reservation._
    - The specialization is _complete_ and _disjoin._
    
    
- The following table shows which properties in the input data apply to which reservation type.

| Property              | Meaning                       | Car | Flight | Hotel |
|-----------------------|-------------------------------|-----|--------|-------|
| reservation_id        | Unique ID, primary key        | X   | X      | X     |
| customer_id           | Unique ID, foreign key        | X   | X      | X     |
| reservation_type      | Enum for type of reservation  | X   | X      | X     |
| price                 | Price to charge               | X   | X      | X     |
| reservation_date      | Date reservation made/changed | X   | X      | X     |
| city                  | City for reservation          | X   |        | X     |
| reservation_start     | Start date                    | X   |        | X     |
| reservation_end       | End date                      | X   |        | X     |
| car_category          | Enum                          | X   |        |       |
| room_category         | Enum                          |     |        | X     |
| bed_category          | Enum                          |     |        | X     |
| flight_departure_time | Takeoff time                  |     | X      |       |
| flight_arrival_time   | Arrival time                  |     | X      |       |
| departure_airport     | Departure airport code        |     | X      |       |
| arrival_airport     | Arrival airport code        |     | X      |       |

- The implementation pattern for inheritance will be:
    - _Reservations_ is a view.
    - There is a table for each of _CarReservation, FlightReservation, HotelReservation._

- We covered a simple example of modeling inheritance in class. The diagram notiation we used for _Person, Student, Faculty_ is:

<img src="./inheritance.png">

- Draw diagram for _Reservation, CarReservation, FlightReservation, HotelReservation_ using the pattern above.


- Your diagram should include a foreign key relationship from _Reservations_ to _Customers._


__Diagram__

- Here, we will use the one-table approach so that each type of reservation is a view, which has almost exactly the same pattern as that of the example we have seen in the lecture. For more details about the requirements of this part, please see Ed ```https://edstem.org/us/courses/32981/discussion/2658227``` . This implementation is intuitive and straightforward 

<img src="./diagram1.png">

## Implement

- You must draw a logical ER diagram for the four tables you will create. Your diagram does not have to include the view.


- Your diagram must include primary keys and foreign keys.


__Diagram__

- One-table approach includes 

<img src="./diagram2.png">

- Save the two dataframes into two tables (using pandas ```to_sql``` and schema ```s23_w4111_hw2_p1_<uni>```)
    - ```customers```
    - ```reservations```

In [24]:
%sql DROP SCHEMA IF EXISTS 23_w4111_hw2_p1_xc2605; # always drop before create
%sql CREATE SCHEMA 23_w4111_hw2_p1_xc2605; #re-create the schema

 * mysql+pymysql://root:***@localhost
2 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
0 rows affected.

[]

In [28]:
print('Customers'customers_df.to_sql('customers', con=engine, schema='23_w4111_hw2_p1_xc2605', if_exists='replace', index=False))
print(reservations_df.to_sql('reservations', con=engine, schema='23_w4111_hw2_p1_xc2605', if_exists='replace', index=False))

1000

- Use SQL to create the tables and data for the three types of reservation.


- Set appropriate data types and keys for the tables. 


- Show and execute your SQL for creating the tables and modifying the schema.

In [26]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?